###################################################################

# Created by write_sdc on Fri Jun 30 07:33:47 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency -max 0.5  [get_clocks clk]
set_clock_latency -source -max 0.5  [get_clocks clk]
set_clock_uncertainty -setup 0.35  [get_clocks clk]
set_clock_transition -max -rise 0.2 [get_clocks clk]
set_clock_transition -max -fall 0.2 [get_clocks clk]
set_input_delay -clock clk  -max 3  [get_ports reset]
set_input_delay -clock clk  -max 3  [get_ports inst_sram_en_toif]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[31]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[30]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[29]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[28]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[27]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[26]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[25]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[24]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[23]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[22]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[21]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[20]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[19]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[18]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[17]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[16]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[15]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[14]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[13]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[12]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[11]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[10]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[9]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[8]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[7]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[6]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[5]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[4]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[3]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[2]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[1]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_wdata[0]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[63]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[62]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[61]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[60]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[59]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[58]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[57]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[56]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[55]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[54]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[53]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[52]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[51]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[50]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[49]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[48]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[47]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[46]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[45]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[44]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[43]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[42]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[41]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[40]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[39]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[38]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[37]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[36]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[35]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[34]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[33]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[32]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[31]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[30]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[29]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[28]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[27]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[26]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[25]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[24]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[23]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[22]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[21]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[20]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[19]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[18]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[17]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[16]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[15]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[14]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[13]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[12]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[11]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[10]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[9]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[8]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[7]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[6]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[5]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[4]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[3]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[2]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[1]}]
set_input_delay -clock clk  -max 3  [get_ports {inst_sram_waddr[0]}]
set_input_delay -clock clk  -max 3  [get_ports inst_sram_wen]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[63]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[62]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[61]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[60]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[59]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[58]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[57]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[56]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[55]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[54]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[53]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[52]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[51]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[50]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[49]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[48]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[47]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[46]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[45]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[44]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[43]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[42]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[41]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[40]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[39]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[38]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[37]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[36]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[35]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[34]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[33]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[32]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[31]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[30]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[29]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[28]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[27]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[26]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[25]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[24]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[23]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[22]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[21]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[20]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[19]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[18]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[17]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[16]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[15]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[14]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[13]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[12]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[11]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[10]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[9]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[8]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[7]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[6]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[5]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[4]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[3]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[2]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[1]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_pc[0]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wen[3]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wen[2]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wen[1]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wen[0]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wnum[4]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wnum[3]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wnum[2]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wnum[1]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wnum[0]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[63]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[62]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[61]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[60]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[59]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[58]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[57]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[56]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[55]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[54]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[53]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[52]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[51]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[50]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[49]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[48]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[47]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[46]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[45]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[44]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[43]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[42]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[41]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[40]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[39]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[38]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[37]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[36]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[35]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[34]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[33]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[32]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[31]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[30]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[29]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[28]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[27]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[26]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[25]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[24]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[23]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[22]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[21]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[20]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[19]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[18]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[17]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[16]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[15]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[14]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[13]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[12]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[11]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[10]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[9]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[8]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[7]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[6]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[5]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[4]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[3]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[2]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[1]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_wb_rf_wdata[0]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[31]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[30]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[29]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[28]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[27]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[26]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[25]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[24]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[23]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[22]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[21]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[20]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[19]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[18]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[17]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[16]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[15]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[14]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[13]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[12]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[11]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[10]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[9]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[8]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[7]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[6]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[5]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[4]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[3]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[2]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[1]}]
set_output_delay -clock clk  -max 3  [get_ports {debug_if_inst[0]}]
